app/views/users/show.html.erb

<h3><%= "Reviews:" if @user.reviews %></h3>
<% @user.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]