app/views/restaurants/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 1]]
---
<h3><%= "Reviews:" if @restaurant.reviews %></h3>
<% @restaurant.reviews.each do |review| %>