app/controllers/comments_controller.rb

    def create
        @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("user_id", "review_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["review_id", 1], ["content", "hey hey"], ["created_at", "2020-07-08 17:04:48.464539"], ["updated_at", "2020-07-08 17:04:48.464539"]]