app/controllers/reviews_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
    def new
        @review = Review.new
        @restaurants = Restaurant.all

INSERT INTO "reviews" ("user_id", "restaurant_id", "rating", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 6], ["restaurant_id", 1], ["rating", 8], ["content", "guac mode activated! "], ["created_at", "2020-07-08 17:22:27.736765"], ["updated_at", "2020-07-08 17:22:27.736765"]]
---
    def create
        @review = Review.create(review_params)