app/controllers/users_controller.rb

INSERT INTO "users" ("username", "name", "location", "photo_url", "bio", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.create(user_params)

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "123456789"], ["updated_at", "2020-07-06 21:07:41.442452"], ["id", 2]]
---
    def update
        if @user.update(user_params)