app/models/restaurant.rb

    def avg_rating
        if self.reviews.count > 0
            self.reviews.map do |review|
                review.rating
            end.sum / self.reviews.count
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 25]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 25]]