app/views/reviews/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = ?  [["review_id", 1]]
---
<h3><%= 'Comments:' if @review.comments %></h3>
<% @review.comments.each do |comment| %>